MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAH176/mcu.h
extern volatile __I2C4RCVbits_t I2C4RCVbits __asm__ ("I2C4RCV") __attribute__((section("sfrs"), address(0xBF820660)));
extern volatile uint32_t        I2C4RCVCLR __attribute__((section("sfrs"),address(0xBF820664)));
extern volatile uint32_t        I2C4RCVSET __attribute__((section("sfrs"),address(0xBF820668)));
extern volatile uint32_t        I2C4RCVINV __attribute__((section("sfrs"),address(0xBF82066C)));
#define I2C5CON I2C5CON
extern volatile uint32_t   I2C5CON __attribute__((section("sfrs"), address(0xBF820800)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t DHEN:1;
    uint32_t AHEN:1;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C5CONbits_t;
extern volatile __I2C5CONbits_t I2C5CONbits __asm__ ("I2C5CON") __attribute__((section("sfrs"), address(0xBF820800)));
extern volatile uint32_t        I2C5CONCLR __attribute__((section("sfrs"),address(0xBF820804)));
extern volatile uint32_t        I2C5CONSET __attribute__((section("sfrs"),address(0xBF820808)));
extern volatile uint32_t        I2C5CONINV __attribute__((section("sfrs"),address(0xBF82080C)));
#define I2C5STAT I2C5STAT
extern volatile uint32_t   I2C5STAT __attribute__((section("sfrs"), address(0xBF820810)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C5STATbits_t;
extern volatile __I2C5STATbits_t I2C5STATbits __asm__ ("I2C5STAT") __attribute__((section("sfrs"), address(0xBF820810)));
extern volatile uint32_t        I2C5STATCLR __attribute__((section("sfrs"),address(0xBF820814)));
extern volatile uint32_t        I2C5STATSET __attribute__((section("sfrs"),address(0xBF820818)));
extern volatile uint32_t        I2C5STATINV __attribute__((section("sfrs"),address(0xBF82081C)));
#define I2C5ADD I2C5ADD
extern volatile uint32_t   I2C5ADD __attribute__((section("sfrs"), address(0xBF820820)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C5ADDbits_t;
extern volatile __I2C5ADDbits_t I2C5ADDbits __asm__ ("I2C5ADD") __attribute__((section("sfrs"), address(0xBF820820)));
extern volatile uint32_t        I2C5ADDCLR __attribute__((section("sfrs"),address(0xBF820824)));
extern volatile uint32_t        I2C5ADDSET __attribute__((section("sfrs"),address(0xBF820828)));
extern volatile uint32_t        I2C5ADDINV __attribute__((section("sfrs"),address(0xBF82082C)));
#define I2C5MSK I2C5MSK
extern volatile uint32_t   I2C5MSK __attribute__((section("sfrs"), address(0xBF820830)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C5MSKbits_t;
extern volatile __I2C5MSKbits_t I2C5MSKbits __asm__ ("I2C5MSK") __attribute__((section("sfrs"), address(0xBF820830)));
extern volatile uint32_t        I2C5MSKCLR __attribute__((section("sfrs"),address(0xBF820834)));
extern volatile uint32_t        I2C5MSKSET __attribute__((section("sfrs"),address(0xBF820838)));
extern volatile uint32_t        I2C5MSKINV __attribute__((section("sfrs"),address(0xBF82083C)));
#define I2C5BRG I2C5BRG
extern volatile uint32_t   I2C5BRG __attribute__((section("sfrs"), address(0xBF820840)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C5BRGbits_t;
extern volatile __I2C5BRGbits_t I2C5BRGbits __asm__ ("I2C5BRG") __attribute__((section("sfrs"), address(0xBF820840)));
extern volatile uint32_t        I2C5BRGCLR __attribute__((section("sfrs"),address(0xBF820844)));
extern volatile uint32_t        I2C5BRGSET __attribute__((section("sfrs"),address(0xBF820848)));
extern volatile uint32_t        I2C5BRGINV __attribute__((section("sfrs"),address(0xBF82084C)));
#define I2C5TRN I2C5TRN
extern volatile uint32_t   I2C5TRN __attribute__((section("sfrs"), address(0xBF820850)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C5TRNbits_t;
extern volatile __I2C5TRNbits_t I2C5TRNbits __asm__ ("I2C5TRN") __attribute__((section("sfrs"), address(0xBF820850)));
extern volatile uint32_t        I2C5TRNCLR __attribute__((section("sfrs"),address(0xBF820854)));
extern volatile uint32_t        I2C5TRNSET __attribute__((section("sfrs"),address(0xBF820858)));
extern volatile uint32_t        I2C5TRNINV __attribute__((section("sfrs"),address(0xBF82085C)));
#define I2C5RCV I2C5RCV
extern volatile uint32_t   I2C5RCV __attribute__((section("sfrs"), address(0xBF820860)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C5RCVbits_t;
extern volatile __I2C5RCVbits_t I2C5RCVbits __asm__ ("I2C5RCV") __attribute__((section("sfrs"), address(0xBF820860)));
extern volatile uint32_t        I2C5RCVCLR __attribute__((section("sfrs"),address(0xBF820864)));
extern volatile uint32_t        I2C5RCVSET __attribute__((section("sfrs"),address(0xBF820868)));
extern volatile uint32_t        I2C5RCVINV __attribute__((section("sfrs"),address(0xBF82086C)));
#define SPI1CON SPI1CON
extern volatile uint32_t   SPI1CON __attribute__((section("sfrs"), address(0xBF821000)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1CONbits_t;
extern volatile __SPI1CONbits_t SPI1CONbits __asm__ ("SPI1CON") __attribute__((section("sfrs"), address(0xBF821000)));
extern volatile uint32_t        SPI1CONCLR __attribute__((section("sfrs"),address(0xBF821004)));
extern volatile uint32_t        SPI1CONSET __attribute__((section("sfrs"),address(0xBF821008)));
extern volatile uint32_t        SPI1CONINV __attribute__((section("sfrs"),address(0xBF82100C)));
#define SPI1STAT SPI1STAT
extern volatile uint32_t   SPI1STAT __attribute__((section("sfrs"), address(0xBF821010)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1STATbits_t;
extern volatile __SPI1STATbits_t SPI1STATbits __asm__ ("SPI1STAT") __attribute__((section("sfrs"), address(0xBF821010)));
extern volatile uint32_t        SPI1STATCLR __attribute__((section("sfrs"),address(0xBF821014)));
extern volatile uint32_t        SPI1STATSET __attribute__((section("sfrs"),address(0xBF821018)));
extern volatile uint32_t        SPI1STATINV __attribute__((section("sfrs"),address(0xBF82101C)));
#define SPI1BUF SPI1BUF
extern volatile uint32_t   SPI1BUF __attribute__((section("sfrs"), address(0xBF821020)));
#define SPI1BRG SPI1BRG
extern volatile uint32_t   SPI1BRG __attribute__((section("sfrs"), address(0xBF821030)));
extern volatile uint32_t        SPI1BRGCLR __attribute__((section("sfrs"),address(0xBF821034)));
extern volatile uint32_t        SPI1BRGSET __attribute__((section("sfrs"),address(0xBF821038)));
extern volatile uint32_t        SPI1BRGINV __attribute__((section("sfrs"),address(0xBF82103C)));
#define SPI1CON2 SPI1CON2
extern volatile uint32_t   SPI1CON2 __attribute__((section("sfrs"), address(0xBF821040)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI1CON2bits_t;
extern volatile __SPI1CON2bits_t SPI1CON2bits __asm__ ("SPI1CON2") __attribute__((section("sfrs"), address(0xBF821040)));
extern volatile uint32_t        SPI1CON2CLR __attribute__((section("sfrs"),address(0xBF821044)));
extern volatile uint32_t        SPI1CON2SET __attribute__((section("sfrs"),address(0xBF821048)));
extern volatile uint32_t        SPI1CON2INV __attribute__((section("sfrs"),address(0xBF82104C)));
#define SPI2CON SPI2CON
extern volatile uint32_t   SPI2CON __attribute__((section("sfrs"), address(0xBF821200)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2CONbits_t;
extern volatile __SPI2CONbits_t SPI2CONbits __asm__ ("SPI2CON") __attribute__((section("sfrs"), address(0xBF821200)));
extern volatile uint32_t        SPI2CONCLR __attribute__((section("sfrs"),address(0xBF821204)));
extern volatile uint32_t        SPI2CONSET __attribute__((section("sfrs"),address(0xBF821208)));
extern volatile uint32_t        SPI2CONINV __attribute__((section("sfrs"),address(0xBF82120C)));
#define SPI2STAT SPI2STAT
extern volatile uint32_t   SPI2STAT __attribute__((section("sfrs"), address(0xBF821210)));
typedef union {
  struct {
    uint32_t SPIRBF:1;
    uint32_t SPITBF:1;
    uint32_t :1;
    uint32_t SPITBE:1;
    uint32_t :1;
    uint32_t SPIRBE:1;
    uint32_t SPIROV:1;
    uint32_t SRMT:1;
    uint32_t SPITUR:1;
    uint32_t :2;
    uint32_t SPIBUSY:1;
    uint32_t FRMERR:1;
    uint32_t :3;
    uint32_t TXBUFELM:5;
    uint32_t :3;
    uint32_t RXBUFELM:5;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2STATbits_t;
extern volatile __SPI2STATbits_t SPI2STATbits __asm__ ("SPI2STAT") __attribute__((section("sfrs"), address(0xBF821210)));
extern volatile uint32_t        SPI2STATCLR __attribute__((section("sfrs"),address(0xBF821214)));
extern volatile uint32_t        SPI2STATSET __attribute__((section("sfrs"),address(0xBF821218)));
extern volatile uint32_t        SPI2STATINV __attribute__((section("sfrs"),address(0xBF82121C)));
#define SPI2BUF SPI2BUF
extern volatile uint32_t   SPI2BUF __attribute__((section("sfrs"), address(0xBF821220)));
#define SPI2BRG SPI2BRG
extern volatile uint32_t   SPI2BRG __attribute__((section("sfrs"), address(0xBF821230)));
extern volatile uint32_t        SPI2BRGCLR __attribute__((section("sfrs"),address(0xBF821234)));
extern volatile uint32_t        SPI2BRGSET __attribute__((section("sfrs"),address(0xBF821238)));
extern volatile uint32_t        SPI2BRGINV __attribute__((section("sfrs"),address(0xBF82123C)));
#define SPI2CON2 SPI2CON2
extern volatile uint32_t   SPI2CON2 __attribute__((section("sfrs"), address(0xBF821240)));
typedef union {
  struct {
    uint32_t AUDMOD:2;
    uint32_t :1;
    uint32_t AUDMONO:1;
    uint32_t :3;
    uint32_t AUDEN:1;
    uint32_t IGNTUR:1;
    uint32_t IGNROV:1;
    uint32_t SPITUREN:1;
    uint32_t SPIROVEN:1;
    uint32_t FRMERREN:1;
    uint32_t :2;
    uint32_t SPISGNEXT:1;
  };
  struct {
    uint32_t AUDMOD0:1;
    uint32_t AUDMOD1:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI2CON2bits_t;
extern volatile __SPI2CON2bits_t SPI2CON2bits __asm__ ("SPI2CON2") __attribute__((section("sfrs"), address(0xBF821240)));
extern volatile uint32_t        SPI2CON2CLR __attribute__((section("sfrs"),address(0xBF821244)));
extern volatile uint32_t        SPI2CON2SET __attribute__((section("sfrs"),address(0xBF821248)));
extern volatile uint32_t        SPI2CON2INV __attribute__((section("sfrs"),address(0xBF82124C)));
#define SPI3CON SPI3CON
extern volatile uint32_t   SPI3CON __attribute__((section("sfrs"), address(0xBF821400)));
typedef union {
  struct {
    uint32_t SRXISEL:2;
    uint32_t STXISEL:2;
    uint32_t DISSDI:1;
    uint32_t MSTEN:1;
    uint32_t CKP:1;
    uint32_t SSEN:1;
    uint32_t CKE:1;
    uint32_t SMP:1;
    uint32_t MODE16:1;
    uint32_t MODE32:1;
    uint32_t DISSDO:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t ENHBUF:1;
    uint32_t SPIFE:1;
    uint32_t :5;
    uint32_t MCLKSEL:1;
    uint32_t FRMCNT:3;
    uint32_t FRMSYPW:1;
    uint32_t MSSEN:1;
    uint32_t FRMPOL:1;
    uint32_t FRMSYNC:1;
    uint32_t FRMEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __SPI3CONbits_t;
