MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAH176/mcu.h
#define _GLCDCURDATA31_PIXEL725_POSITION         0x00000018
#define _GLCDCURDATA31_PIXEL725_MASK             0x0F000000
#define _GLCDCURDATA31_PIXEL725_LENGTH           0x00000004

#define _GLCDCURDATA31_PIXEL724_POSITION         0x0000001C
#define _GLCDCURDATA31_PIXEL724_MASK             0xF0000000
#define _GLCDCURDATA31_PIXEL724_LENGTH           0x00000004

#define _GLCDCURDATA32_PIXEL87_POSITION          0x00000000
#define _GLCDCURDATA32_PIXEL87_MASK              0x0000000F
#define _GLCDCURDATA32_PIXEL87_LENGTH            0x00000004

#define _GLCDCURDATA32_PIXEL86_POSITION          0x00000004
#define _GLCDCURDATA32_PIXEL86_MASK              0x000000F0
#define _GLCDCURDATA32_PIXEL86_LENGTH            0x00000004

#define _GLCDCURDATA32_PIXEL85_POSITION          0x00000008
#define _GLCDCURDATA32_PIXEL85_MASK              0x00000F00
#define _GLCDCURDATA32_PIXEL85_LENGTH            0x00000004

#define _GLCDCURDATA32_PIXEL84_POSITION          0x0000000C
#define _GLCDCURDATA32_PIXEL84_MASK              0x0000F000
#define _GLCDCURDATA32_PIXEL84_LENGTH            0x00000004

#define _GLCDCURDATA32_PIXEL83_POSITION          0x00000010
#define _GLCDCURDATA32_PIXEL83_MASK              0x000F0000
#define _GLCDCURDATA32_PIXEL83_LENGTH            0x00000004

#define _GLCDCURDATA32_PIXEL82_POSITION          0x00000014
#define _GLCDCURDATA32_PIXEL82_MASK              0x00F00000
#define _GLCDCURDATA32_PIXEL82_LENGTH            0x00000004

#define _GLCDCURDATA32_PIXEL81_POSITION          0x00000018
#define _GLCDCURDATA32_PIXEL81_MASK              0x0F000000
#define _GLCDCURDATA32_PIXEL81_LENGTH            0x00000004

#define _GLCDCURDATA32_PIXEL80_POSITION          0x0000001C
#define _GLCDCURDATA32_PIXEL80_MASK              0xF0000000
#define _GLCDCURDATA32_PIXEL80_LENGTH            0x00000004

#define _GLCDCURDATA33_PIXEL815_POSITION         0x00000000
#define _GLCDCURDATA33_PIXEL815_MASK             0x0000000F
#define _GLCDCURDATA33_PIXEL815_LENGTH           0x00000004

#define _GLCDCURDATA33_PIXEL814_POSITION         0x00000004
#define _GLCDCURDATA33_PIXEL814_MASK             0x000000F0
#define _GLCDCURDATA33_PIXEL814_LENGTH           0x00000004

#define _GLCDCURDATA33_PIXEL813_POSITION         0x00000008
#define _GLCDCURDATA33_PIXEL813_MASK             0x00000F00
#define _GLCDCURDATA33_PIXEL813_LENGTH           0x00000004

#define _GLCDCURDATA33_PIXEL812_POSITION         0x0000000C
#define _GLCDCURDATA33_PIXEL812_MASK             0x0000F000
#define _GLCDCURDATA33_PIXEL812_LENGTH           0x00000004

#define _GLCDCURDATA33_PIXEL811_POSITION         0x00000010
#define _GLCDCURDATA33_PIXEL811_MASK             0x000F0000
#define _GLCDCURDATA33_PIXEL811_LENGTH           0x00000004

#define _GLCDCURDATA33_PIXEL810_POSITION         0x00000014
#define _GLCDCURDATA33_PIXEL810_MASK             0x00F00000
#define _GLCDCURDATA33_PIXEL810_LENGTH           0x00000004

#define _GLCDCURDATA33_PIXEL89_POSITION          0x00000018
#define _GLCDCURDATA33_PIXEL89_MASK              0x0F000000
#define _GLCDCURDATA33_PIXEL89_LENGTH            0x00000004

#define _GLCDCURDATA33_PIXEL88_POSITION          0x0000001C
#define _GLCDCURDATA33_PIXEL88_MASK              0xF0000000
#define _GLCDCURDATA33_PIXEL88_LENGTH            0x00000004

#define _GLCDCURDATA34_PIXEL823_POSITION         0x00000000
#define _GLCDCURDATA34_PIXEL823_MASK             0x0000000F
#define _GLCDCURDATA34_PIXEL823_LENGTH           0x00000004

#define _GLCDCURDATA34_PIXEL822_POSITION         0x00000004
#define _GLCDCURDATA34_PIXEL822_MASK             0x000000F0
#define _GLCDCURDATA34_PIXEL822_LENGTH           0x00000004

#define _GLCDCURDATA34_PIXEL821_POSITION         0x00000008
#define _GLCDCURDATA34_PIXEL821_MASK             0x00000F00
#define _GLCDCURDATA34_PIXEL821_LENGTH           0x00000004

#define _GLCDCURDATA34_PIXEL820_POSITION         0x0000000C
#define _GLCDCURDATA34_PIXEL820_MASK             0x0000F000
#define _GLCDCURDATA34_PIXEL820_LENGTH           0x00000004

#define _GLCDCURDATA34_PIXEL819_POSITION         0x00000010
#define _GLCDCURDATA34_PIXEL819_MASK             0x000F0000
#define _GLCDCURDATA34_PIXEL819_LENGTH           0x00000004

#define _GLCDCURDATA34_PIXEL818_POSITION         0x00000014
#define _GLCDCURDATA34_PIXEL818_MASK             0x00F00000
#define _GLCDCURDATA34_PIXEL818_LENGTH           0x00000004

#define _GLCDCURDATA34_PIXEL817_POSITION         0x00000018
#define _GLCDCURDATA34_PIXEL817_MASK             0x0F000000
#define _GLCDCURDATA34_PIXEL817_LENGTH           0x00000004

#define _GLCDCURDATA34_PIXEL816_POSITION         0x0000001C
#define _GLCDCURDATA34_PIXEL816_MASK             0xF0000000
#define _GLCDCURDATA34_PIXEL816_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL831_POSITION         0x00000000
#define _GLCDCURDATA35_PIXEL831_MASK             0x0000000F
#define _GLCDCURDATA35_PIXEL831_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL830_POSITION         0x00000004
#define _GLCDCURDATA35_PIXEL830_MASK             0x000000F0
#define _GLCDCURDATA35_PIXEL830_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL829_POSITION         0x00000008
#define _GLCDCURDATA35_PIXEL829_MASK             0x00000F00
#define _GLCDCURDATA35_PIXEL829_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL828_POSITION         0x0000000C
#define _GLCDCURDATA35_PIXEL828_MASK             0x0000F000
#define _GLCDCURDATA35_PIXEL828_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL827_POSITION         0x00000010
#define _GLCDCURDATA35_PIXEL827_MASK             0x000F0000
#define _GLCDCURDATA35_PIXEL827_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL826_POSITION         0x00000014
#define _GLCDCURDATA35_PIXEL826_MASK             0x00F00000
#define _GLCDCURDATA35_PIXEL826_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL825_POSITION         0x00000018
#define _GLCDCURDATA35_PIXEL825_MASK             0x0F000000
#define _GLCDCURDATA35_PIXEL825_LENGTH           0x00000004

#define _GLCDCURDATA35_PIXEL824_POSITION         0x0000001C
#define _GLCDCURDATA35_PIXEL824_MASK             0xF0000000
#define _GLCDCURDATA35_PIXEL824_LENGTH           0x00000004

#define _GLCDCURDATA36_PIXEL97_POSITION          0x00000000
#define _GLCDCURDATA36_PIXEL97_MASK              0x0000000F
#define _GLCDCURDATA36_PIXEL97_LENGTH            0x00000004

